Autodesk.Revit.DB.FamilyManager.ReorderParameters(System.Collections.Generic.IList`1{Autodesk.Revit.DB.FamilyParameter})
Reorders the family parameters by the specified parameters order.
parameters:
The new parameters order for the family.
The contents of this collection should consist of exactly the same parameters returned by the GetParameters() method.
This will include invisible parameters; they can be reordered but this will have no effect when viewing the parameters in the Revit UI.
Remarks:
Reordering the parameters only affects visible parameters within the same parameter group.
Parameters that belong to different groups will remain separated, and the groups' order will not be affected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input parameters collection does not contain the same parameters as those returned by GetParameters().
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this family is a Rebar Shape family which doesn't support parameters reorder.
Since: 2015